app/controllers/api/v1/users/sessions_controller.rb

        def create
          user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'test2@example.com' LIMIT 1